Repository: br-automation-com/mapp-Framework
Catalog: mappFramework/Logical/mappView/Resources/Texts/UserList.tmx
Source language: en
Languages: de, fr, sv

source: Confirm
de: Bestätigen
fr: Confirmer
sv: Upprepa

source: User account requirements:
de: Benutzerkonto Anforderungen:
fr: Conditions necessaires:
sv: Lösenordet kräver alfanumeriska tecken

source: Password
de: Passwort
fr: Mot de passe
sv: Lösenord

source: Password cannot be empty
de: Passwort darf nicht leer sein
fr: Mot de passe doit être renseigné
sv: Lösenordet får ej lämnas blankt

source: Confirm password does not match
de: Passwortwiederholung stimmt nicht dem neuen Passwort überein
fr: Mot de passe ne correspond pas
sv: Lösenordet matchar inte det upprepade

source: Username must not be empty
de: Benutzername darf nicht leer sein
fr: Nom d'utilisateur doit être renseigné
sv: Användarnamnet får ej lämnas blankt

source: Confirm password
de: Passwort bestätigen
fr: Confirmer le mot de passe
sv: Upprepa lösenord

source: Full name
de: Vollständiger Name
fr: Nom complet
sv: Fullständigt namn

source: Username
de: Benutzername
fr: Nom de l'utilisateur
sv: Användarnamn

source: Alphanumerical characters are necessary in the password
de: Alphanumerische Zeichen sind im Passwort erforderlich
fr: Des caractères alphanumériques doivent être utilisés dans le mot de passe
sv: Alfanumeriska tecken krävs i Lösenordet

source: {1} or more characters required in the password
de: {1} oder mehr Zeichen sind im Passwort erforderlich
fr: {1} ou plusieurs caractères doivent être renseignés dans le mot de passe
sv: {1} eller fler tecken krävs i Lösenordet

source: Upper- and lowercase letters required in the password
de: Groß- und Kleinbuchstaben sind im Passwort erforderlich
fr: Des lettres majuscules et minuscules doivent être utilisés dans le mot de passe
sv: Versaler och gemener krävs i Lösenordet

source: At least one special character (e.g. $£]) required in the password
de: Mindestens ein Sonderzeichen (z.B. %$ö) ist erforderlich
fr: Au moins un caractère spécial (!%]) doit être utilisé dans le mot de passe
sv: Åtminstone ett specialtecken (t.ex. $£]) krävs i Lösenordet

source: Available roles
de: Verfügbare Rollen
fr: Rôles disponibles
sv: Tillgängliga användargrupper

source: Add a user
de: Benutzer hinzufügen
fr: Ajout d'un utilisateur
sv: Lägg till användare

source: User
de: Benutzer
fr: Utilisateur
sv: Användare

source: {1} or more characters required in the username
de: {1} oder mehr Zeichen sind im Benutzernamen erforderlich
fr: {1} ou plusieurs caractères doivent être renseignés dans le nom de l'utilisateur
sv: {1} eller fler tecken krävs i användarnamnet

source: Success
de: Erfolg
fr: Succès

source: Internal error in MpUserX
de: interner Fehler in MpUserX
fr: Erreur interne à MpUserX
sv: Internt fel i MpUserX

source: Non authorized user
de: Nicht autorisierter Benutzer
fr: Utilisateur non autorisé
sv: Ogiltig användare

source: Session not valid
de: Session nicht gültig
fr: Session invalide
sv: Session ej giltig

source: Password policies not met
de: Passwort-Richtlinien nicht erfüllt
fr: Règles pour le mot de passe non respectées
sv: Lösenordkrav ej uppfyllda

source: User doesn’t exist
de: Benutzer existiert nicht
fr: L'utilisateur n'existe pas
sv: Användaren existerar ej

source: User already exists
de: Benutzer existiert bereits
fr: L'utilisateur existe déjà
sv: Användaren existerar redan

source: Insufficient rights
de: Ungenügende Rechte
fr: Droits non suffisants
sv: Otillräckliga användarrättigheter

source: Role doesn’t exist
de: Rolle existiert nicht
fr: Rôle n'existe pas
sv: Användarroll existerar ej

source: Too many roles
de: Zu viele Rollen
fr: Trop de rôles
sv: För många användarroller

source: Username empty
de: Benutzername leer
fr: Nom d'utilisateur vide
sv: Användarnamn är tomt

source: Action not allowed (when called in central mode/on central users)
de: Aktion nicht erlaubt (bei Aufruf im zentralen Modus/bei zentralen Benutzern)
fr: Action non autorisée (quand appelé depuis mode central/ central utilisateur)
sv: Action ej tillåtet (system inställt på central mode/användare)

source: User currently logged in
de: Derzeit angemeldeter Benutzer
fr: Utilisateur déjà connecté
sv: Användaren är inloggad

source: Password empty
de: Passwort leer
fr: Mot de passe vide
sv: Lösenord tomt

source: Username is too short
de: Benutzername ist zu kurz
fr: Le nom d'utilisateur est trop court
sv: Användarnamnet är för kort

source: Anonymous cannot be deleted
de: Anonymous kann nicht gelöscht werden
fr: Anonymous ne peut être supprimé
sv: Anonymous kan inte tas bort

source: Reset password
de: Passwort zurücksetzen
fr: Réinitialiser le mot de passe
sv: Återställ lösenord

source: User locked
de: Benutzer gesperrt
fr: Utilisateur verrouillé
sv: Användare låst

source: Change password
de: Passwort ändern
fr: Changer mot de passe
sv: Ändra lösenord

source: Modify a user
de: Einen Benutzer ändern
fr: Modifier un utilisateur
sv: Ändra en användare

source: Do you really want to delete the selected user?
de: Möchten Sie den ausgewählten Benutzer wirklich löschen?

source: Delete a user
de: Einen Benutzer löschen

source: User successfully deleted
de: Benutzer erfolgreich gelöscht

source: Cannot delete user, session not valid
de: Benutzer kann nicht gelöscht werden, Sitzung ungültig

source: Cannot delete user, user does not exist
de: Benutzer kann nicht gelöscht werden, Benutzer existiert nicht

source: Cannot delete user, insufficient rights
de: Benutzer kann nicht gelöscht werden, unzureichende Rechte

source: Cannot delete user, currently logged-in user
de: Benutzer kann nicht gelöscht werden, derzeit angemeldeter Benutzer

source: Cannot delete user, anonymous cannot be deleted.
de: Benutzer kann nicht gelöscht werden, anonym kann nicht gelöscht werden.

source: Name
fr: Nom
sv: Namn
